# Hello Python

In [1]:
#Getting Started
3+5

8

# Getting started with basics of python

In [2]:
print("Hello")

Hello

# Concatenation using * operator

In [3]:
print("Hello"*5)

HelloHelloHelloHelloHello

# Introduction to list

In [6]:
list = ["abc",11,12.256, "aa"]
print(list[:-1])

['abc', 11, 12.256]

## Append function

In [7]:
list.append("daw")

In [8]:
print(list)

['abc', 11, 12.256, 'aa', 'daw']

## appending a string multiple times

In [48]:
print(list*3)

[11, 12.256, 'daw', 'abc', 11, 12.256, 'aa', 'daw', 'abc', 11, 12.256, 'aa', 'daw', 'abc', 11, 12.256, 'aa', 'daw', 11, 12.256, 'daw', 'abc', 11, 12.256, 'aa', 'daw', 'abc', 11, 12.256, 'aa', 'daw', 'abc', 11, 12.256, 'aa', 'daw', 11, 12.256, 'daw', 'abc', 11, 12.256, 'aa', 'daw', 'abc', 11, 12.256, 'aa', 'daw', 'abc', 11, 12.256, 'aa', 'daw']

## Extend functionality

In [12]:
list.extend(list)
print(list)

['abc', 11, 12.256, 'aa', 'daw', 'abc', 11, 12.256, 'aa', 'daw', 'abc', 11, 12.256, 'aa', 'daw', 'abc', 11, 12.256, 'aa', 'daw']

In [13]:
list

['abc',
 11,
 12.256,
 'aa',
 'daw',
 'abc',
 11,
 12.256,
 'aa',
 'daw',
 'abc',
 11,
 12.256,
 'aa',
 'daw',
 'abc',
 11,
 12.256,
 'aa',
 'daw']

## Delete element from list

In [14]:
del list[0]

In [15]:
list

[11,
 12.256,
 'aa',
 'daw',
 'abc',
 11,
 12.256,
 'aa',
 'daw',
 'abc',
 11,
 12.256,
 'aa',
 'daw',
 'abc',
 11,
 12.256,
 'aa',
 'daw']

In [16]:
list.remove("aa")

In [17]:
list

[11,
 12.256,
 'daw',
 'abc',
 11,
 12.256,
 'aa',
 'daw',
 'abc',
 11,
 12.256,
 'aa',
 'daw',
 'abc',
 11,
 12.256,
 'aa',
 'daw']

# Importing Numpy and defining a function to add elements of a list and print the elements of another list

In [46]:
import numpy as np
def getSum(list2):
    sum = 0
    
    list1 = np.ones(10, dtype=int)
    list1 = list1 + 25
    
    list2 = list2[:10]
    
    print(list1)
    print(list2)
    
    for i in list2:
        sum = sum+list1[list2.index(i)]
        print(i)
        
    return sum
print("Sum is ",":",getSum(list))

[26 26 26 26 26 26 26 26 26 26]
[11, 12.256, 'daw', 'abc', 11, 12.256, 'aa', 'daw', 'abc', 11]
11
12.256
daw
abc
11
12.256
aa
daw
abc
11
Sum is  : 260

# Creating Json

In [19]:
import json
def getJson(mylist):
    str1 = json.dumps(mylist)
    print(str1)
list1 = {"1":"daw","2":"25998"}
getJson(list1)

{"1": "daw", "2": "25998"}

# Reading cvs

In [15]:
import pandas as pd

file = pd.read_csv("read_csv/data.csv")
file.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Reading its shape

In [17]:
file.shape

(891, 12)

In [20]:
file.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## Exploring the dataframe

In [52]:
file.loc[:,['Survived','Name']]

     Survived                                               Name
0           0                            Braund, Mr. Owen Harris
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1                             Heikkinen, Miss. Laina
3           1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0                           Allen, Mr. William Henry
..        ...                                                ...
886         0                              Montvila, Rev. Juozas
887         1                       Graham, Miss. Margaret Edith
888         0           Johnston, Miss. Catherine Helen "Carrie"
889         1                              Behr, Mr. Karl Howell
890         0                                Dooley, Mr. Patrick

[891 rows x 2 columns]

 ## Seleting rows index basis

In [40]:
file.iloc[1:5,:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Seleting colomns

In [48]:
#Seleting the first 4 colomns
file.iloc[1:2,4:5]

      Sex
1  female

In [36]:
file[file["Survived"]==1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [39]:
file2 = pd.read_csv("data_python.csv")
file2.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y